driver-tests/bpelse/empty/EmptyBpel/src/EmptyScope/EmptyScope.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" 
	xmlns:slnk="http://schemas.xmlsoap.org/ws/2002/07/service-link/" 
	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
	xmlns:tns="http://stc.com/EmptyScope" 
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="EmptyScope" 
	targetNamespace="http://stc.com/EmptyScope">
    <types>
        <xsd:schema elementFormDefault="qualified" targetNamespace="http://stc.com/EmptyScope">
            <xsd:element name="item">
                <xsd:complexType>
                    <xsd:sequence>
                        <xsd:element name="value" type="xsd:string"/>
                    </xsd:sequence>
                </xsd:complexType>
            </xsd:element>
        </xsd:schema>
    </types>
    <message name="EmptyScope">
        <part element="tns:item" name="part"/>
    </message>
    <portType name="EmptyScope">
        <operation name="EmptyScope">
            <input message="tns:EmptyScope"/>
            <output message="tns:EmptyScope"/>
        </operation>
    </portType>
    <binding name="Binding" type="tns:EmptyScope">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="EmptyScope">
            <soap:operation soapAction="EmptyScope"/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="EmptyScopeService">
        <port binding="tns:Binding" name="port">
            <soap:address location="http://localhost:${HttpDefaultPort}/EmptyScope"/>
        </port>
    </service>
    <plnk:partnerLinkType xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" name="SLT">
        <plnk:role name="server" portType="tns:EmptyScope"/>
    </plnk:partnerLinkType>
</definitions>
