driver-tests/bpelse/empty/EmptyJbi/test/EmptyScope10/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:EmptySequence="http://stc.com/EmptyScope">
  <soapenv:Body>
    <EmptySequence:item>
      <EmptySequence:value>Empty Scope Testing</EmptySequence:value>
    </EmptySequence:item>
  </soapenv:Body>
</soapenv:Envelope>